tutorial/dahl_knvary_HBexperiment/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       15760;
    }
    outlet
    {
        type            patch;
        nFaces          4;
        startFace       15800;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       15804;
    }
    endWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          36;
        startFace       16004;
    }
    top
    {
        type            patch;
        nFaces          200;
        startFace       16040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       16240;
    }
)

// ************************************************************************* //
