tutorial/dahl_knvary_HBexperiment/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Dm              Dm [0 2 -1 0 0 0 0] 2e-9;
Sc              Sc [0 0 0 0 0 0 0] 0.7;

phases (sludge water);

sludge
{
    transportModel  HBexperiment;

    "(HBexperiment)Coeffs"
    {
        k	       	0.01;
        n	       	0.6;
        tau0	    	6e-4;
        tauCoeffs	5.90e-4;	//-tauy= tauCoeffs*exp(tauExpo*alpha)
        tauExpo		1050.8;
        kCoeffs		0.003816;	//-k= kCoeffs*exp(kExpo*alpha)
        kExpo		71.07006;
        mu0	        1.8e-3;
       
    }

    rho         1996;
}


water
{
    transportModel  Newtonian;

    nu              1.7871e-06;
    rho             996;
}

relativeVelocityModel simple;

"(simple|general)Coeffs"
{
    V0              (0 -0.002198 0);
    a               285.84;
    a1              0.1;
    residualAlpha   0;
}


// ************************************************************************* //
